[
  {
    "id": 1,
    "name": "MERN stack complete Blog Application from scratch 2022",
    "slug": "mern-stack-complete-blog-application-from-scratch-2022",
    "category": "Web Development",
    "short_details": "Learn, Apply, Build a Blog Project using Redux (Redux Toolkit), NodeJs, Express, MongoDB, React js, Tailwindcss",
    "description": "<p><strong>Course description:</strong></p><p>This course is all about managing the state in react application using the redux toolkit. Each topic included in this course is added incrementally, to make sure that you have a solid foundation of knowledge. You'll find plenty of discussions added in to help you understand exactly when and where to use </p><p><strong><em>What will you build?</em></strong></p><ul><li><p>Learn how to create a real-world blog application with a bunch of features</p></li><li><p>Develop Node Js API from scratch</p></li><li><p>How to implement react js logic to real-world application</p></li><li><p>Understand backend authentication</p></li><li><p>Learn how to upload files to Cloudinary</p></li><li><p>Learn how to block&nbsp; and unblock a user</p></li><li><p>Learn how to block a user by the application if&nbsp; the post the user is creating contains sum profane words</p></li><li><p>Learn how to resize images on the server-side</p></li><li><p>Learn how to implement&nbsp; forget password functionality</p></li><li><p>Learn how to implement follow and unfollow a user</p></li><li><p>Learn how to manage state in react using redux (redux toolkit)</p></li><li><p>How to implement account verification using a token</p></li><li><p>Learn how to implement sending Emails using Sendgrid</p></li><li><p>How to implement user management</p></li><li><p>Learn how to implement like and dislike of a post</p></li></ul><p><br></p><p><strong>Who this course is for:</strong></p><ul><li><p>Programmers looking to master MERN Stack</p></li><li><p>Developers who want to&nbsp; move from the traditional way of writing redux application</p></li><li><p>Engineers who have researched React but have had trouble mastering some concepts</p></li></ul>",
    "thumbnail_image": "https://i.ibb.co/YkNfJqR/mern-stack-complete-blog-application-from-scratch-2022.png",
    "instructor": "Rakib Alom",
    "publish_date": "10 October, 2022",
    "total_times": "4 hours 45 minutes",
    "ratings": {
      "numbers": "4.5",
      "total_reviews": "145"
    },
    "purchase_price": "$15.99"
  },
  {
    "id": 2,
    "name": "React Native - The Practical Guide [2022]",
    "slug": "react-native-the-practical-guide-2022",
    "category": "Mobile App Development",
    "short_details": "Use React Native and your React knowledge to build native iOS and Android Apps - incl. Push Notifications, Hooks, Redux",
    "description": "<p><strong>This course was updated (completely re-recorded) in April 2022 - you learn the latest version of React Native with this course!</strong></p><p>---</p><p><strong>Mobile apps</strong>&nbsp;are one of the best ways to engage with users - no wonder everyone wants to build one!</p><p>Wouldn't it be great if you could use your&nbsp;<strong>web development knowledge</strong>, combined with your&nbsp;<strong>React</strong>&nbsp;knowledge, to&nbsp;<strong>build mobile apps</strong>&nbsp;with that?</p><p><strong>That's exactly what React Native allows you to do!</strong></p><p>No need&nbsp;to learn Java, Android, Swift, ObjectiveC or anything of that -&nbsp;<strong>React and JavaScript is all you need&nbsp;</strong>to create awesome native mobile apps that work on both Android and iOS. That's probably the reason why Instagram, AirBnB,&nbsp;Skype and many other global companies&nbsp;are using it to build their mobile apps!</p><p>With this course, you can join this league. I'll teach you all you need to create your own React Native apps, publish them to the Google Play Store and Apple App Store and dive really deep into the React Native ecosystem.</p><p>You'll learn all about the theory behind React Native, its core concepts, how to build responsive designs that work on different device sizes, how to navigate around, use maps and the camera and so much more!</p><p>And which better way to learn&nbsp;than by&nbsp;<strong>building a real app?</strong>&nbsp;We'll build the '<strong>Favorite Places</strong>' &nbsp;app in this course, an app where users can share amazing pictures and the location where they took them. This app will allow you to see things like using maps, the camera, user authentication, connecting to a server and much more in action.</p><p>By the end of the course, we'll of course also go through all steps required to get it into an app store.</p><p><strong>Here's a detailed look at what you'll get:</strong></p><ul><li><p>The core concepts and theory</p></li><li><p>How to use React, JavaScript and native components</p></li><li><p>Understand how to navigate in React Native apps</p></li><li><p>A closer look at styling and animating React Native apps</p></li><li><p>Instructions on how to use third-party libraries in your React Native app</p></li><li><p>Detailed examples on how to use maps or an image picker</p></li><li><p>A full user authentication flow</p></li><li><p>How to connect to a backend server from your app</p></li><li><p>Debugging instructions</p></li><li><p>And so much more!</p></li></ul><p><strong>What will you need to succeed in this course?</strong></p><ul><li><p>NO&nbsp;Android, Java, Swift or ObjectiveC knowledge is required!</p></li><li><p>JavaScript and React (for the web) knowledge is required though - you don't need to be an expert but the basics need to be set (though there are refresher sections in this course!)</p></li></ul><p>I'd be very happy to welcome you in the course!</p>",
    "thumbnail_image": "https://i.ibb.co/HH5p23G/react-native-the-practical-guide-2022.png",
    "instructor": "David C.",
    "publish_date": "1st September, 2022",
    "total_times": "28 hours 37 minutes",
    "ratings": {
      "numbers": "4.9",
      "total_reviews": "1260"
    },
    "purchase_price": "$12.99"
  },
  {
    "id": 3,
    "name": "Learn Python: The Complete Python Programming Course",
    "slug": "learn-python-the-complete-python-programming-course",
    "category": "Programming Languages",
    "short_details": "Learn A-Z everything about Python, from the basics, to advanced topics like Python GUI, Python Data Analysis, and more!",
    "description": "<p><strong>Do you want to become a programmer? Do you want to learn how to create games, automate your browser, visualize data, and much more? </strong></p><p>If you’re looking to learn Python for the very <strong>first time</strong> or need a <strong>quick brush-up</strong>, this is the course for you! </p><p>Python has rapidly become one of the <strong>most popular programming languages </strong>around the world. Compared to other languages such as Java or C++, Python consistently outranks and outperforms these languages in demand from businesses and job availability. The average Python developer makes <strong>over $100,000 </strong>- this number is only going to grow in the coming years.</p><p>The best part? Python is one of the <strong>easiest coding languages </strong>to learn right now. It doesn’t matter if you have no programming experience or are unfamiliar with the syntax of Python. By the time you finish this course, you'll be an <strong>absolute pro</strong> at programming!</p><p>This course will cover <strong>all the basics</strong> and <strong>several advanced concepts</strong> of Python. We’ll go over:</p><ul><li><p>The fundamentals of Python programming</p></li><li><p>Writing and Reading to Files</p></li><li><p>Automation of Word and Excel Files</p></li><li><p>Web scraping with BeautifulSoup4</p></li><li><p>Browser automation with Selenium</p></li><li><p>Data Analysis and Visualization with MatPlotLib</p></li><li><p>Regex parsing and Task Management</p></li><li><p>GUI and Gaming with Tkinter</p></li><li><p>And much more!</p></li></ul><p>If you read the above list and are feeling a bit confused, don’t worry! As an instructor and student on Udemy for <strong>almost 4 years,</strong> I know what it’s like to be overwhelmed with boring and mundane. I promise you’ll have a blast learning the ins and outs of python. I’ve successfully taught over<strong> 200,000+ students </strong>from over<strong> 200 countries</strong> jumpstart their programming journeys through my courses. </p><p>Here’s what some of my students have to say:</p><ul><li><p>“I wish I started programming at a younger age like Avi. &nbsp;This Python course was excellent for those that cringe at the thought of starting over from scratch with attempts to write programs once again. Python is a great building language for any beginner programmer. Thank you Avi!”</p><p><br></p></li><li><p>“I had no idea about any programming language. With Avi's lectures, I'm now aware of several python concepts and I'm beginning to write my own programs. Avi is crisp and clear in his lectures and it is easy to catch the concepts and the depth of it through his explanations. Thanks, Avi for the wonderful course, You're awesome! It's helping me a lot :)”</p><p><br></p></li><li><p> 'Videos are short and concise and well-defined in their title, this makes them easy to refer back to when a refresher is needed. Explanations aren't convoluted with complicated examples, which adds to the quick pace of the videos. I am very pleased with the decision to enroll in this course. Not only has it increased the pace I'm learning Python but I actively look forward to continuing the course, whenever I get the chance. Avi is friendly and energetic, absolutely delightful as an instructor.”</p></li></ul><p>So what are you waiting for? <strong>Jumpstart your programming journey</strong> and dive into the world of Python by<strong> enrolling in this course today!</strong></p>",
    "thumbnail_image": "https://i.ibb.co/sgxFqmk/learn-python-the-complete-python-programming-course.jpg",
    "instructor": "Avinash Jain",
    "publish_date": "25 February, 2015",
    "total_times": "14 hours 42 minutes",
    "ratings": {
      "numbers": "4.0",
      "total_reviews": "9650"
    },
    "purchase_price": "$10.99"
  },
  {
    "id": 4,
    "name": "Master SketchUp - A Definitive Guide From Infinite Skills",
    "slug": "master-sketchup-a-definitive-guide-from-infinite-skills",
    "category": "3D & Animation",
    "short_details": "A easy to follow SketchUp course that teaches using practical examples.",
    "description": "<p>This SketchUp 2013 training course from Infinite Skills teaches you how to model a home from scratch using this popular 3D modeling program. This tutorial is designed for the absolute beginner, meaning no prior experience with SketchUP or 3D modeling is required.</p><p><br>You will start by learning the basics of the drawing tools, and then quickly jump into learning to create different roof types. This course will show you how to organize the model, including creating the second floor and additional openings, using the outliner, and viewing layer states of the model. This video tutorial will show you how to create the different parts of a home, including the ceiling, staircase, doors and windows, fireplace, and kitchen. You will learn how to add furniture using the 3D warehouse and model the furniture from a photograph. You will then move to creating the exterior of the home, from setting the building in place to adding solar panels. Finally, Dan will show you various exporting options and how to create a rendering and animation.<br> <br>By the completion of this computer based training course, you will be comfortable using many of the basic and complex tools in SketchUp. Working files are included, allowing you to follow along with the author throughout the lessons.</p>",
    "thumbnail_image": "https://i.ibb.co/Wf1ybDG/master-sketchup-a-definitive-guide-from-infinite-skills.jpg",
    "instructor": "Martin R.",
    "publish_date": "10 October, 2017",
    "total_times": "5 hours 40 minutes",
    "ratings": {
      "numbers": "4.2",
      "total_reviews": "3500"
    },
    "purchase_price": "$12.99"
  },
  {
    "id": 5,
    "name": "Practical Next.js & React - Build a real WebApp with Next.js",
    "slug": "practical-next-js-react-build-a-real-webapp-with-next-js",
    "category": "Web Development",
    "short_details": "Build Fullstack WebApp with Next.js, React, and Strapi backend. Storybook components library. Practical Next.js & React",
    "description": "<p>Learn a straightforward way to build a real<strong> Fullstack web application with React&nbsp;&amp; Next.js + Typescript!</strong></p><p><strong>Next.js</strong> gives you the best developer experience with all the features you need for production: hybrid static &amp; server rendering, TypeScript support, smart bundling, route pre-fetching, etc. No config is required.</p><p><strong>Next.js</strong> is the<strong> </strong>production-ready, framework for <strong>React JS</strong>!</p><p>Data fetching in Next.js allows you to render content in different ways. These include pre-rendering with <strong>Server-side Rendering</strong> or <strong>Static Generation</strong>, and updating or creating content at runtime with <strong>Incremental Static Regeneration</strong>. It can make your applications very fast!</p><p>During the course, we'll cover the most important topics.</p><p>There're presented <strong>TDD or TLD approaches</strong> that I'll try to practice with you during the coding sessions. Probably you don't have enough experience with the tests, but it's ok, there's still an excellent way to learn it from the course. When you work with code and cover it with test cases, it provides you with guarantees that your code works as you expected. This is the purpose and benefit of the tests.<br>Tools for testing:&nbsp;<strong>Jest, React Testing Library</strong></p><p>Storybook is the most popular way to build the components library. From our side, it's the most basic part of the course. We'll install and configure Storybook, which will provide us with a full components spec. This approach is called Components Driven Development.<br><strong>CSS-IN-JS, EmotionJS, and Styled-Components</strong> are very powerful toolkits to build UI&nbsp;components. Even very complex component styles can be easily produced and supported by it.</p><p><strong>We create Dark and Light modes for your application with EmotionJS&nbsp;and styled-components API and NextJS!</strong></p><p><strong>GitHub Actions </strong>makes it easy to automate all your software workflows, now with world-class CI/CD. Build, test, and deploy your code right from GitHub. Make code reviews, branch management, and issue triaging work the way you want. We create our deployment workflow!</p><p>Last but not least it's <strong>Redux</strong>. Redux is a beautiful way to manage an application state. <strong>We'll use the Redux-Toolkit library</strong> - it simplifies the work with Redux.<br><strong>Check out the full curriculum and free preview videos. Join the course risk-free with a 30-day money-back guarantee!</strong><br>See you on the course!</p>",
    "thumbnail_image": "https://i.ibb.co/svhfhh1/practical-next-js-react-build-a-real-webapp-with-next-js.png",
    "instructor": "Nick Ovchinnikov",
    "publish_date": "8 August, 2022",
    "total_times": "10 hours 49 minutes",
    "ratings": {
      "numbers": "4.4",
      "total_reviews": "111"
    },
    "purchase_price": "$15.00"
  },
  {
    "id": 6,
    "name": "The Ultimate SEO Training 2022 + SEO For Wordpress Websites",
    "slug": "the-ultimate-seo-training-2022",
    "category": "Search Engine Optimization",
    "short_details": "SEO Training From An SEO Agency Owner: Step By Step Process To Rank #1 on Google. Keyword Research, Technical SEO & More",
    "description": "<p><strong><em>Stop wasting time following so called 'SEO Experts' that do not practice what they preach.<br><br>I own the Award Winning SEO Agency in the UK and in this course, I'll reveal the entire process we use at the agency to rank a website onto the first page of Google, step by step.<br><br></em></strong>This process is <strong>PROVEN</strong> and works.<strong><br><br></strong>Maybe you’re completely new to SEO or maybe you’re an advanced SEO expert and are looking to expand your knowledge.<br><br>Whichever one it is, you can be sure I’ve got you covered.<br><br>I don’t just talk the talk; I actually walk the walk and live it too.<br><br>At the end of the course I’m going to share with you some <strong>real-time</strong> results that I’ve managed to achieve for my own website and clients websites too all by following the same strategies you’re going to learn in this course.<br><br>This stuff is <strong>SUPER</strong> powerful.<br><br>Instead of just giving you the theory and then leaving it up to you to figure it all out, you can watch over my shoulder and see how to implement everything! From the keyword research, Onpage SEO, Link building.. you name it.. I'll show you exactly how everything is done.<br><br>I'll also give you access to the exact spreadsheets I use at my agency so you have everything at your disposal.<br><br><strong>What you’ll learn by taking this SEO course</strong></p><p><br></p><ul><li><p>Learn more about SEO and understand how it all works</p></li><li><p>How to structure and optimise your website to rank on page 1</p></li><li><p>How to find the best keywords to target for your website</p></li><li><p>Understanding the role of content in SEO</p></li><li><p>Find out how to spy on your competitors and see what SEO efforts they have been getting up to</p></li><li><p>How to find 100s of content ideas for your blog</p></li><li><p>How to build powerful backlinks that will crush the competition</p></li><li><p>Master technical SEO and outsmart your competitors</p></li></ul><p><br></p><p>Literally everything you need to be able to implement a successful SEO campaign.<br><br>There are tons of resources for you to download throughout the course and lots of bonus tips and tricks you can use as well.<br><br><strong>Fact: </strong>67,000 searches are performed every second on Google. Out of those 67,000 searches, 80% of people ignore the ads.<br><br>There’s never been a better time to learn SEO:<br></p><p>Let’s make sure your website is one of the websites consumers will find.<br></p><p><strong>MONEY-BACK GUARANTEE</strong></p><p>Before we go any further, let us just say, I don’t want you to be disappointed.<br><br>If you don’t like this course for any reason, you can get a full refund in the first 30 days, which is backed by Udemy’s 30-day guarantee, with no questions asked!<br><br>This is not just a guarantee, it's my personal promise to you that I will go out of my way to help you succeed.<br></p><p><strong>Knowledge is power. Invest today and never look back!<br></strong></p><p><strong>Enrol now.</strong></p>",
    "thumbnail_image": "https://i.ibb.co/p1rFspB/the-ultimate-seo-training-2022.png",
    "instructor": "Velizar S.",
    "publish_date": "10 October, 2022",
    "total_times": "12 hours 5 minutes",
    "ratings": {
      "numbers": "4.7",
      "total_reviews": "5452"
    },
    "purchase_price": "$11.99"
  }
]